org/2014-12-31-misc.org
#+TITLE: misc
#+DATE: 2014-12-31
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: misc
#+JEKYLL_PUBLISHED: true

この辺りはよく解らないパッケージ情報を載せています。

* 有用？
*** food-dice
飯を決めるのがめんどくさい人に。サイコロ飯が出来ます。
候補を入れるだけで、何か適当に出してくれます。
#+BEGIN_SRC 
(setq fooddice/meals '(pizza pommes burger noodles bread soup chinese sushi))
(setq fooddice/drinks '(cola water coffee tea beer whisky milk cacao icetea energydrink))
(setq fooddice/restaurants '(italian chinese thai american japanese))
#+END_SRC
#+BEGIN_SRC 
M-x what-to-eat
M-x where-to-eat
M-x what-to-drink
#+END_SRC


* ゲーム
*** Dunnet
昔のテキストアドベンチャーゲーム。
コマンドを自分で打って探して進めて行くタイプのです。
暇つぶしと英単語力を試すのに良いかも。
#+BEGIN_SRC 
M-x dunnet
#+END_SRC
*** gomoku
五目並べ。とても強いです。
罵ってくるので余裕のある時に。
#+BEGIN_SRC 
M-x gomoku
#+END_SRC

