_posts/2014-12-31-misc.html
---
title: "misc"
date: 2014-12-31
layout: post
categories: misc
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 有用？</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-0-1">1.0.1. food-dice</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. ゲーム</a>
<ul>
<li>
<ul>
<li><a href="#sec-2-0-1">2.0.1. Dunnet</a></li>
<li><a href="#sec-2-0-2">2.0.2. gomoku</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
この辺りはよく解らないパッケージ情報を載せています。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 有用？</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1"><span class="section-number-4">1.0.1</span> food-dice</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
飯を決めるのがめんどくさい人に。サイコロ飯が出来ます。
候補を入れるだけで、何か適当に出してくれます。
</p>
<pre class="example">
(setq fooddice/meals '(pizza pommes burger noodles bread soup chinese sushi))
(setq fooddice/drinks '(cola water coffee tea beer whisky milk cacao icetea energydrink))
(setq fooddice/restaurants '(italian chinese thai american japanese))
</pre>
<pre class="example">
M-x what-to-eat
M-x where-to-eat
M-x what-to-drink
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> ゲーム</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-0-1" class="outline-4">
<h4 id="sec-2-0-1"><span class="section-number-4">2.0.1</span> Dunnet</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
昔のテキストアドベンチャーゲーム。
コマンドを自分で打って探して進めて行くタイプのです。
暇つぶしと英単語力を試すのに良いかも。
</p>
<pre class="example">
M-x dunnet
</pre>
</div>
</div>
<div id="outline-container-sec-2-0-2" class="outline-4">
<h4 id="sec-2-0-2"><span class="section-number-4">2.0.2</span> gomoku</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
五目並べ。とても強いです。
罵ってくるので余裕のある時に。
</p>
<pre class="example">
M-x gomoku
</pre>
</div>
</div>
</div>
